content/posts/emacsconf-2021-imaginary-programming.md
+++
title = "EmacsConf 2021 - Imaginary Programming"
author = ["Shane Mulligan"]
date = 2021-09-05T00:00:00+12:00
keywords = ["imaginary-programming", "gpt", "emacs"]
draft = false
+++

## Talk: <span class="underline">Imaginary Programming</span> {#talk}


### Abstract: {#abstract}

Imaginary Programming (IP) is both methodology and paradigm. It is an extension
of literate programming and a way of creating software without the use of
imperative, functional or even declarative code. Yet IP employs all disciplines
to achieve the miraculous. The only contingency is on one or more language
models, known by Standford AI as foundation models. The real value of IP is not
found by abandoning sound logic altogether, but in weaving the real with the
imaginary. The future of imaginary programming is one in which almost all of
computing is inferred. I have built a suite of tools based on emacs for
interfacing real programming languages with imaginary ones; All of this in
order to demonstrate what I mean. A 'complex' terminal that lets you imagine
what happens no matter how nested you are within interpreters, an example-oriented
language, a file format that encodes the provenance of text and a library for
imaginary functional programming primitives called iLambda. It is important to
recognise IP because, for lack of a better term, it has far-reaching implications for
intellectual property and the GPL. Please keep an open mind.


### Outlines: {#outlines}

-   5-10 minutes:

    But in this timeframe I would give:

    -   a 5 minute introduction to imaginary programming, followed by
    -   a demonstraction of iLambda.
        -   [iλ, a family of imaginary programming libraries](https://mullikine.github.io/posts/designing-an-imaginary-programming-ip-library-for-emacs/)

-   20 minutes:

    In the timeframe I would give:

    -   a 5 minute introduction to imaginary programming, followed by
    -   a 5 minute introduction and demonstraction of Pen.el.
        <https://semiosis.github.io/pen/>
    -   a 5 minute org-babel and emacs lisp demonstraction of iLambda.
        -   [iλ, a family of imaginary programming libraries](https://mullikine.github.io/posts/designing-an-imaginary-programming-ip-library-for-emacs/)
    -   a 5 minute demonstration of 'cterm' (complex term) and 'ii' (imaginary interpreter).
        -   <https://mullikine.github.io/posts/imaginary-real-codex-complex/>
        -   <https://semiosis.github.io/ii/>

-   40 minutes:
    -   A 10 minute introduction to language models, their capabilities and imaginary programming.
    -   A 10 minute introduction to creating prompts with Pen.el.
    -   a 5 minute org-babel and emacs lisp demonstraction of iLambda.
        -   [iλ, a family of imaginary programming libraries](https://mullikine.github.io/posts/designing-an-imaginary-programming-ip-library-for-emacs/)
    -   a 5 minute demonstration of 'cterm' (complex term) and 'ii' (imaginary interpreter).
        -   <https://mullikine.github.io/posts/imaginary-real-codex-complex/>
        -   <https://semiosis.github.io/ii/>
    -   A 5 minute brief on examplary and advanced prompt programming.
        <https://semiosis.github.io/examplary/>
    -   5 minutes for Prompting Requests and Q&A


### Availability {#availability}

(during the conference days (Nov 27 and 28))

All hours.


### How you'd like to handle questions {#how-you-d-like-to-handle-questions}


#### Live web conference {#live-web-conference}

IRC
: `libertyprime` at `#emacs` on `libera`